# KINEVA_M | G. Hilgemann for REBOTNIX GmbH, 10.2024
# All rights reserved.
nc: 3  # number of classes
depth_multiple: 1.0  # models depth multiple
width_multiple: 1.0  # layer channel multiple

anchors:
  - [10, 13, 16, 30, 33, 23]  # P3/8 (optimiert mit k-means)
  - [30, 61, 62, 45, 59, 119]  # P4/16
  - [116, 90, 156, 198, 373, 326]  # P5/32

backbone:
  # [from, number, module, args]
  [[-1, 1, DWConv, [32, 3, 1]],  # 0 (Depthwise Separable Convolution)
   [-1, 1, DWConv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, Conv, [64, 3, 1]],

   [-1, 1, DWConv, [128, 3, 2]],  # 3-P2/4
   [-1, 1, CSP, [64]],  # CSP-Block 
   [-1, 1, SE, [64]],  # Squeeze-and-Excitation Block

   [-1, 1, DWConv, [128, 3, 2]],  # 6
   [-1, 1, CSP, [128]],  # CSP
   [-1, 1, SE, [128]],

   [-1, 1, DWConv, [256, 3, 2]],  # 9-P3/8
   [-1, 1, CSP, [256]],  # CSP

   [-1, 1, DWConv, [512, 3, 2]],  # 12-P4/16
   [-1, 1, CSP, [512]],  # CSP
   [-1, 1, SE, [512]],

   [-1, 1, DWConv, [1024, 3, 2]],  # 15-P5/32
   [-1, 1, CSP, [1024]],  # CSP
  ]

head:
  [[-1, 1, SPPCSPC, [512]],  # SPP with Cross Stage Partial

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [12, 1, Conv, [256, 1, 1]],  # route backbone P4
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, CSP, [256]],  # CSP in Head f
   [-1, 1, SE, [256]],

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [9, 1, Conv, [128, 1, 1]],  # route backbone P3
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, CSP, [128]],  # CSP
   [-1, 1, SE, [128]],

   [-1, 1, DWConv, [128, 3, 1]],  # Replace Conv with DWConv for lightweight computation
   [-1, 1, DWConv, [64, 3, 1]],
   [-1, 1, SE, [64]],

   [[-1, -2, -3], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]],  # 26

   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [[-1, 26], 1, Concat, [1]],  # Concatenated with CSP Output for improved context

   [-1, 1, CSP, [256]],  # Additional CSP Block
   [-1, 1, Conv, [512, 1, 1]],

   [26, 1, RepConv, [256, 3, 1]],  # 33
   [-1, 1, RepConv, [512, 3, 1]],  # 34
   [-1, 1, RepConv, [1024, 3, 1]],  # 35

   [[33, 34, 35], 1, KinevaDDCSP, [nc, anchors, DWConv]],  # Detection head using optimized anchors
  ]